zephyrproject-rtos/trusted-firmware-m/trusted-firmware-m/platform/ext/target/cypress/psoc64/target_cfg.c
/*
 * Copyright (c) 2018 Arm Limited
 * Copyright (c) 2019-2020, Cypress Semiconductor Corporation. All rights reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include <inttypes.h>

#include "cy_prot.h"
#include "cycfg.h"
#include "device_definition.h"
#include "driver_ppu.h"
#include "driver_smpu.h"
#include "pc_config.h"
#include "platform_description.h"
#include "region.h"
#include "region_defs.h"
#include "RTE_Device.h"
#include "target_cfg.h"
#include "tfm_plat_defs.h"
#include "tfm_spm_log.h"


/* The section names come from the scatter file */
REGION_DECLARE(Load$$LR$$, LR_NS_PARTITION, $$Base);
#ifdef BL2
REGION_DECLARE(Load$$LR$$, LR_SECONDARY_PARTITION, $$Base);
#endif /* BL2 */

const struct memory_region_limits memory_regions = {
    .non_secure_code_start =
        (uint32_t)&REGION_NAME(Load$$LR$$, LR_NS_PARTITION, $$Base) +
        CYBL_HEADER_SIZE,

    .non_secure_partition_base =
        (uint32_t)&REGION_NAME(Load$$LR$$, LR_NS_PARTITION, $$Base),

    .non_secure_partition_limit =
        (uint32_t)&REGION_NAME(Load$$LR$$, LR_NS_PARTITION, $$Base) +
        NS_PARTITION_SIZE - 1,
};


#ifdef BL2
REGION_DECLARE(Load$$LR$$, LR_SECONDARY_PARTITION, $$Base);
#endif /* BL2 */

/* To write into AIRCR register, 0x5FA value must be write to the VECTKEY field,
 * otherwise the processor ignores the write.
 */
#define SCB_AIRCR_WRITE_MASK ((0x5FAUL << SCB_AIRCR_VECTKEY_Pos))

struct tfm_spm_partition_platform_data_t tfm_peripheral_std_uart = {
        SCB5_BASE,
        SCB5_BASE + 0xFFF,
        -1,
        -1
};

struct tfm_spm_partition_platform_data_t tfm_peripheral_timer0 = {
        TCPWM0_BASE,
        TCPWM0_BASE + (sizeof(TCPWM_Type) - 1),
        -1,
        -1
};

void enable_fault_handlers(void)
{
    /* Fault handles enable registers are not present in Cortex-M0+ */
}

void system_reset_cfg(void)
{
    uint32_t reg_value = SCB->AIRCR;

    /* Clear SCB_AIRCR_VECTKEY value */
    reg_value &= ~(uint32_t)(SCB_AIRCR_VECTKEY_Msk);

    /* Set Access Key (0x05FA must be written to this field) */
    reg_value |= (uint32_t)(SCB_AIRCR_WRITE_MASK);

    SCB->AIRCR = reg_value;
}

extern void Cy_Platform_Init(void);
void platform_init(void)
{
    cy_en_sysclk_status_t clk_rc;
#ifdef TFM_ENABLE_IRQ_TEST
    cy_en_sysint_status_t int_rc;
#endif

    Cy_PDL_Init(CY_DEVICE_CFG);

    init_cycfg_all();

    /* UART clock */
    clk_rc = Cy_SysClk_PeriphDisableDivider(CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure UART clock\r\n");
    }
    clk_rc = Cy_SysClk_PeriphSetDivider(CY_SYSCLK_DIV_8_BIT, 1U, 108U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure UART clock\r\n");
    }
    clk_rc = Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure UART clock\r\n");
    }
    clk_rc = Cy_SysClk_PeriphAssignDivider(PCLK_SCB5_CLOCK, CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure UART clock\r\n");
    }
    /* Secure: TIMER0 clock */
    clk_rc = Cy_SysClk_PeriphAssignDivider(PCLK_TCPWM0_CLOCKS0, CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure timer0 clock\r\n");
    }
    /* Non-Secure: TIMER1 clock */
    clk_rc = Cy_SysClk_PeriphAssignDivider(PCLK_TCPWM0_CLOCKS1, CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure timer1 clock\r\n");
    }

    Cy_Platform_Init();

#ifdef TFM_ENABLE_IRQ_TEST
    int_rc = Cy_SysInt_Init(&CY_TCPWM_NVIC_CFG_S, TFM_TIMER0_IRQ_Handler);
    if (int_rc != CY_SYSINT_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Fail to initialize timer interrupt (IRQ TEST might fail)!\r\n");
    }
#endif /* TFM_ENABLE_IRQ_TEST */

    /* make sure CM4 is disabled */
    if (CY_SYS_CM4_STATUS_ENABLED == Cy_SysGetCM4Status()) {
        Cy_SysDisableCM4();
    }
}

enum tfm_plat_err_t nvic_interrupt_target_state_cfg(void)
{
    return TFM_PLAT_ERR_SUCCESS;
}

enum tfm_plat_err_t nvic_interrupt_enable(void)
{
    /* PPU and SMPU don't generate interrupts.
     * USART and Flash drivers don't export an EnableInterrupt function.
     * So there's nothing to do here.
     */
    return TFM_PLAT_ERR_SUCCESS;
}

enum tfm_plat_err_t bus_masters_cfg(void)
{
    /* Cortex-M4 - PC=6 */
    if (Cy_Prot_SetActivePC(CPUSS_MS_ID_CM4,
                            CY_PROT_HOST_DEFAULT) != CY_PROT_SUCCESS) {
        return TFM_PLAT_ERR_SYSTEM_ERR;
    }

    /* Test Controller - PC=7 */
    if (Cy_Prot_SetActivePC(CPUSS_MS_ID_TC, CY_PROT_TC) != CY_PROT_SUCCESS) {
        return TFM_PLAT_ERR_SYSTEM_ERR;
    }

    /* Cortex-M0+ - PC=1 */
    if (Cy_Prot_SetActivePC(CPUSS_MS_ID_CM0,
                            CY_PROT_SPM_DEFAULT) != CY_PROT_SUCCESS) {
        return TFM_PLAT_ERR_SYSTEM_ERR;
    }

    return TFM_PLAT_ERR_SUCCESS;
}

const SMPU_Resources *smpu_init_table[] = {
#if RTE_SMPU0
    &SMPU0_Resources,
#endif

#if RTE_SMPU1
    &SMPU1_Resources,
#endif

#if RTE_SMPU2
    &SMPU2_Resources,
#endif

#if RTE_SMPU3
    &SMPU3_Resources,
#endif

#if RTE_SMPU4
    &SMPU4_Resources,
#endif

#if RTE_SMPU5
    &SMPU5_Resources,
#endif

#if RTE_SMPU6
    &SMPU6_Resources,
#endif

#if RTE_SMPU7
    &SMPU7_Resources,
#endif

#if RTE_SMPU8
    &SMPU8_Resources,
#endif

#if RTE_SMPU9
    &SMPU9_Resources,
#endif

#if RTE_SMPU10
    &SMPU10_Resources,
#endif

#if RTE_SMPU11
    &SMPU11_Resources,
#endif

#if RTE_SMPU12
    &SMPU12_Resources,
#endif

#if RTE_SMPU13
    &SMPU13_Resources,
#endif
};

enum tfm_plat_err_t smpu_init_cfg(void)
{
    enum tfm_plat_err_t ret = TFM_PLAT_ERR_SUCCESS;

