zephyrproject-rtos/trusted-firmware-m/trusted-firmware-m/platform/ext/target/cypress/psoc64/target_cfg.c
    size_t n = sizeof(smpu_init_table)/sizeof(smpu_init_table[0]);

    for (int i = (n - 1); i >= 0; i--)
    {
        if (SMPU_Configure(smpu_init_table[i]) != CY_PROT_SUCCESS) {
            ret = TFM_PLAT_ERR_SYSTEM_ERR;
        }
    }

    /* Now protect all unconfigured SMPUs */
    if(protect_unconfigured_smpus() != CY_PROT_SUCCESS) {
        ret = TFM_PLAT_ERR_SYSTEM_ERR;
    }

    __DSB();
    __ISB();

    return ret;
}

void smpu_print_config(void)
{
    SPMLOG_INFMSG("\r\nSMPU config:\r\n");
    SPMLOG_INFMSGVAL("memory_regions.non_secure_code_start = ",
            memory_regions.non_secure_code_start);
    SPMLOG_INFMSGVAL("memory_regions.non_secure_partition_base = ",
            memory_regions.non_secure_partition_base);
    SPMLOG_INFMSGVAL("memory_regions.non_secure_partition_limit = ",
            memory_regions.non_secure_partition_limit);

    size_t n = sizeof(smpu_init_table)/sizeof(smpu_init_table[0]);

    for (int i = 0; i < n; i++)
    {
        SMPU_Print_Config(smpu_init_table[i]);
    }
}

const PPU_Resources *ppu_init_table[] = {
#if RTE_MS_PPU_PR7
&PR7_PPU_Resources,
#endif
#if RTE_MS_PPU_PERI_MAIN
    &PERI_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR0_GROUP
    &PERI_GR0_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR1_GROUP
    &PERI_GR1_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR2_GROUP
    &PERI_GR2_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR3_GROUP
    &PERI_GR3_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR4_GROUP
    &PERI_GR4_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR6_GROUP
    &PERI_GR6_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR9_GROUP
    &PERI_GR9_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR10_GROUP
    &PERI_GR10_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_TR
    &PERI_TR_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_MAIN
    &CRYPTO_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_CRYPTO
    &CRYPTO_CRYPTO_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_BOOT
    &CRYPTO_BOOT_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_KEY0
    &CRYPTO_KEY0_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_KEY1
    &CRYPTO_KEY1_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_BUF
    &CRYPTO_BUF_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_CM4
    &CPUSS_CM4_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_CM0
    &CPUSS_CM0_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_BOOT
    &CPUSS_BOOT_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_CM0_INT
    &CPUSS_CM0_INT_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_CM4_INT
    &CPUSS_CM4_INT_PPU_Resources,
#endif

#if RTE_MS_PPU_FAULT_STRUCT0_MAIN
    &FAULT_STRUCT0_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_FAULT_STRUCT1_MAIN
    &FAULT_STRUCT1_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT0_IPC
    &IPC_STRUCT0_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT1_IPC
    &IPC_STRUCT1_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT2_IPC
    &IPC_STRUCT2_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT3_IPC
    &IPC_STRUCT3_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT4_IPC
    &IPC_STRUCT4_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT5_IPC
    &IPC_STRUCT5_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT6_IPC
    &IPC_STRUCT6_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT7_IPC
    &IPC_STRUCT7_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT8_IPC
    &IPC_STRUCT8_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT9_IPC
    &IPC_STRUCT9_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT10_IPC
    &IPC_STRUCT10_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT11_IPC
    &IPC_STRUCT11_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT12_IPC
    &IPC_STRUCT12_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT13_IPC
    &IPC_STRUCT13_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT14_IPC
    &IPC_STRUCT14_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT15_IPC
    &IPC_STRUCT15_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT0_INTR
    &IPC_INTR_STRUCT0_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT1_INTR
    &IPC_INTR_STRUCT1_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT2_INTR
    &IPC_INTR_STRUCT2_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT3_INTR
    &IPC_INTR_STRUCT3_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT4_INTR
    &IPC_INTR_STRUCT4_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT5_INTR
    &IPC_INTR_STRUCT5_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT6_INTR
    &IPC_INTR_STRUCT6_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT7_INTR
    &IPC_INTR_STRUCT7_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT8_INTR
    &IPC_INTR_STRUCT8_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT9_INTR
    &IPC_INTR_STRUCT9_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT10_INTR
    &IPC_INTR_STRUCT10_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT11_INTR
    &IPC_INTR_STRUCT11_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT12_INTR
    &IPC_INTR_STRUCT12_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT13_INTR
    &IPC_INTR_STRUCT13_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT14_INTR
    &IPC_INTR_STRUCT14_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT15_INTR
    &IPC_INTR_STRUCT15_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_PROT_SMPU_MAIN
    &PROT_SMPU_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_PROT_MPU0_MAIN
    &PROT_MPU0_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_PROT_MPU5_MAIN
    &PROT_MPU5_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_PROT_MPU6_MAIN
    &PROT_MPU6_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_PROT_MPU14_MAIN
    &PROT_MPU14_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_PROT_MPU15_MAIN
    &PROT_MPU15_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_MAIN
    &FLASHC_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_CMD
    &FLASHC_CMD_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_DFT
    &FLASHC_DFT_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_CM0
    &FLASHC_CM0_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_CM4
    &FLASHC_CM4_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_CRYPTO
    &FLASHC_CRYPTO_PPU_Resources,
#endif

