zephyrproject-rtos/trusted-firmware-m/trusted-firmware-m/platform/ext/target/cypress/psoc64/target_cfg.c
#if RTE_MS_PPU_FLASHC_DW0
    &FLASHC_DW0_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_DW1
    &FLASHC_DW1_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_DMAC
    &FLASHC_DMAC_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_EXT_MS0
    &FLASHC_EXT_MS0_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_EXT_MS1
    &FLASHC_EXT_MS1_PPU_Resources,
#endif

#if RTE_MS_PPU_FLASHC_FM
    &FLASHC_FM_PPU_Resources,
#endif

#if RTE_MS_PPU_SRSS_MAIN1
    &SRSS_MAIN1_PPU_Resources,
#endif

#if RTE_MS_PPU_SRSS_MAIN2
    &SRSS_MAIN2_PPU_Resources,
#endif

#if RTE_MS_PPU_WDT
    &WDT_PPU_Resources,
#endif

#if RTE_MS_PPU_MAIN
    &MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_SRSS_MAIN3
    &SRSS_MAIN3_PPU_Resources,
#endif

#if RTE_MS_PPU_SRSS_MAIN4
    &SRSS_MAIN4_PPU_Resources,
#endif

#if RTE_MS_PPU_SRSS_MAIN5
    &SRSS_MAIN5_PPU_Resources,
#endif

#if RTE_MS_PPU_SRSS_MAIN6
    &SRSS_MAIN6_PPU_Resources,
#endif

#if RTE_MS_PPU_SRSS_MAIN7
    &SRSS_MAIN7_PPU_Resources,
#endif

#if RTE_MS_PPU_BACKUP_BACKUP
    &BACKUP_BACKUP_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_DW
    &DW0_DW_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_DW
    &DW1_DW_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_DW_CRC
    &DW0_DW_CRC_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_DW_CRC
    &DW1_DW_CRC_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT0_CH
    &DW0_CH_STRUCT0_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT1_CH
    &DW0_CH_STRUCT1_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT2_CH
    &DW0_CH_STRUCT2_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT3_CH
    &DW0_CH_STRUCT3_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT4_CH
    &DW0_CH_STRUCT4_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT5_CH
    &DW0_CH_STRUCT5_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT6_CH
    &DW0_CH_STRUCT6_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT7_CH
    &DW0_CH_STRUCT7_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT8_CH
    &DW0_CH_STRUCT8_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT9_CH
    &DW0_CH_STRUCT9_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT10_CH
    &DW0_CH_STRUCT10_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT11_CH
    &DW0_CH_STRUCT11_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT12_CH
    &DW0_CH_STRUCT12_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT13_CH
    &DW0_CH_STRUCT13_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT14_CH
    &DW0_CH_STRUCT14_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT15_CH
    &DW0_CH_STRUCT15_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT16_CH
    &DW0_CH_STRUCT16_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT17_CH
    &DW0_CH_STRUCT17_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT18_CH
    &DW0_CH_STRUCT18_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT19_CH
    &DW0_CH_STRUCT19_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT20_CH
    &DW0_CH_STRUCT20_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT21_CH
    &DW0_CH_STRUCT21_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT22_CH
    &DW0_CH_STRUCT22_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT23_CH
    &DW0_CH_STRUCT23_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT24_CH
    &DW0_CH_STRUCT24_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT25_CH
    &DW0_CH_STRUCT25_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT26_CH
    &DW0_CH_STRUCT26_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT27_CH
    &DW0_CH_STRUCT27_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW0_CH_STRUCT28_CH
    &DW0_CH_STRUCT28_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT0_CH
    &DW1_CH_STRUCT0_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT1_CH
    &DW1_CH_STRUCT1_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT2_CH
    &DW1_CH_STRUCT2_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT3_CH
    &DW1_CH_STRUCT3_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT4_CH
    &DW1_CH_STRUCT4_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT5_CH
    &DW1_CH_STRUCT5_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT6_CH
    &DW1_CH_STRUCT6_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT7_CH
    &DW1_CH_STRUCT7_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT8_CH
    &DW1_CH_STRUCT8_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT9_CH
    &DW1_CH_STRUCT9_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT10_CH
    &DW1_CH_STRUCT10_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT11_CH
    &DW1_CH_STRUCT11_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT12_CH
    &DW1_CH_STRUCT12_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT13_CH
    &DW1_CH_STRUCT13_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT14_CH
    &DW1_CH_STRUCT14_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT15_CH
    &DW1_CH_STRUCT15_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT16_CH
    &DW1_CH_STRUCT16_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT17_CH
    &DW1_CH_STRUCT17_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT18_CH
    &DW1_CH_STRUCT18_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT19_CH
    &DW1_CH_STRUCT19_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT20_CH
    &DW1_CH_STRUCT20_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT21_CH
    &DW1_CH_STRUCT21_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT22_CH
    &DW1_CH_STRUCT22_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT23_CH
    &DW1_CH_STRUCT23_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT24_CH
    &DW1_CH_STRUCT24_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT25_CH
    &DW1_CH_STRUCT25_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT26_CH
    &DW1_CH_STRUCT26_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT27_CH
    &DW1_CH_STRUCT27_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT28_CH
    &DW1_CH_STRUCT28_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_TOP
    &DMAC_TOP_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_CH0_CH
    &DMAC_CH0_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_CH1_CH
    &DMAC_CH1_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_CH2_CH
    &DMAC_CH2_CH_PPU_Resources,
#endif

